work/log/db-sysbench-postgres-oltp-rw-small/iter-0/sysbench/logs/sysbench-raw-1-1
sysbench --db-driver=pgsql --pgsql-db=pgtest --test=oltp --oltp-test-mode=complex --oltp-table-size=91683000 --num-threads=1 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 1

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140000
        write:                           50000
        other:                           20000
        total:                           210000
    transactions:                        10000  (156.52 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 190000 (2973.94 per sec.)
    other operations:                    20000  (313.05 per sec.)

Test execution summary:
    total time:                          63.8882s
    total number of events:              10000
    total time taken by event execution: 63.8079
    per-request statistics:
         min:                                  5.40ms
         avg:                                  6.38ms
         max:                               1383.50ms
         approx.  95 percentile:               6.27ms

Threads fairness:
    events (avg/stddev):           10000.0000/0.00
    execution time (avg/stddev):   63.8079/0.00