work/log/db-sysbench-postgres-oltp-rw-small/iter-0/sysbench/logs/sysbench-raw-1-2
sysbench --db-driver=pgsql --pgsql-db=pgtest --test=oltp --oltp-test-mode=complex --oltp-table-size=91683000 --num-threads=1 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 1

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140000
        write:                           50000
        other:                           20000
        total:                           210000
    transactions:                        10000  (46.93 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 190000 (891.67 per sec.)
    other operations:                    20000  (93.86 per sec.)

Test execution summary:
    total time:                          213.0836s
    total number of events:              10000
    total time taken by event execution: 213.0039
    per-request statistics:
         min:                                  5.36ms
         avg:                                 21.30ms
         max:                               3036.12ms
         approx.  95 percentile:              65.91ms

Threads fairness:
    events (avg/stddev):           10000.0000/0.00
    execution time (avg/stddev):   213.0039/0.00