work/log/db-sysbench-postgres-oltp-rw-small/iter-0/sysbench/logs/sysbench-raw-5-2
sysbench --db-driver=pgsql --pgsql-db=pgtest --test=oltp --oltp-test-mode=complex --oltp-table-size=91683000 --num-threads=5 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 5

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140434
        write:                           50155
        other:                           20062
        total:                           210651
    transactions:                        10031  (386.57 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 190589 (7344.79 per sec.)
    other operations:                    20062  (773.14 per sec.)

Test execution summary:
    total time:                          25.9489s
    total number of events:              10031
    total time taken by event execution: 129.6358
    per-request statistics:
         min:                                 10.93ms
         avg:                                 12.92ms
         max:                                 55.16ms
         approx.  95 percentile:              12.85ms

Threads fairness:
    events (avg/stddev):           2006.2000/34.13
    execution time (avg/stddev):   25.9272/0.00